valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL2_DROOPVH_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL2_DROOPVH_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL2_DROOPVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL2_DROOPVL_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL2_DROOPVL_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL2_DROOPVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL2_SYNCMAXDEV_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL2_SYNCMAXDEV_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL2_SYNCMAXDEV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL2_SYNCHYST_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL2_SYNCHYST_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL2_SYNCHYST_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL2_SYNCMUXSEL_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL2_SYNCMUXSEL_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL2_SYNCMUXSEL_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL2_Bits.LCK */
#define IFX_PMS_EVRSDCTRL2_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.MODSEL */
#define IFX_PMS_EVRSDCTRL3_MODSEL_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.MODSEL */
#define IFX_PMS_EVRSDCTRL3_MODSEL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.MODSEL */
#define IFX_PMS_EVRSDCTRL3_MODSEL_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.BYPSEL */
#define IFX_PMS_EVRSDCTRL3_BYPSEL_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.BYPSEL */
#define IFX_PMS_EVRSDCTRL3_BYPSEL_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.BYPSEL */
#define IFX_PMS_EVRSDCTRL3_BYPSEL_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL3_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL3_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL3_Bits.LCK */
#define IFX_PMS_EVRSDCTRL3_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.SDVOKLVL */
#define IFX_PMS_EVRSDCTRL4_SDVOKLVL_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.SDVOKLVL */
#define IFX_PMS_EVRSDCTRL4_SDVOKLVL_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.SDVOKLVL */
#define IFX_PMS_EVRSDCTRL4_SDVOKLVL_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.SDLUT */
#define IFX_PMS_EVRSDCTRL4_SDLUT_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.SDLUT */
#define IFX_PMS_EVRSDCTRL4_SDLUT_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.SDLUT */
#define IFX_PMS_EVRSDCTRL4_SDLUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.OLEN */
#define IFX_PMS_EVRSDCTRL4_OLEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.OLEN */
#define IFX_PMS_EVRSDCTRL4_OLEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.OLEN */
#define IFX_PMS_EVRSDCTRL4_OLEN_OFF (15u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.SDOLCON */
#define IFX_PMS_EVRSDCTRL4_SDOLCON_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.SDOLCON */
#define IFX_PMS_EVRSDCTRL4_SDOLCON_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.SDOLCON */
#define IFX_PMS_EVRSDCTRL4_SDOLCON_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.ZEROBIN */
#define IFX_PMS_EVRSDCTRL4_ZEROBIN_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.ZEROBIN */
#define IFX_PMS_EVRSDCTRL4_ZEROBIN_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.ZEROBIN */
#define IFX_PMS_EVRSDCTRL4_ZEROBIN_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL4_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL4_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL4_Bits.LCK */
#define IFX_PMS_EVRSDCTRL4_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED3V3 */
#define IFX_PMS_EVRSDCTRL5_STSPEED3V3_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED3V3 */
#define IFX_PMS_EVRSDCTRL5_STSPEED3V3_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED3V3 */
#define IFX_PMS_EVRSDCTRL5_STSPEED3V3_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STDTEN */
#define IFX_PMS_EVRSDCTRL5_STDTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STDTEN */
#define IFX_PMS_EVRSDCTRL5_STDTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STDTEN */
#define IFX_PMS_EVRSDCTRL5_STDTEN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STDT */
#define IFX_PMS_EVRSDCTRL5_STDT_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STDT */
#define IFX_PMS_EVRSDCTRL5_STDT_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STDT */
#define IFX_PMS_EVRSDCTRL5_STDT_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED5V */
#define IFX_PMS_EVRSDCTRL5_STSPEED5V_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED5V */
#define IFX_PMS_EVRSDCTRL5_STSPEED5V_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STSPEED5V */
#define IFX_PMS_EVRSDCTRL5_STSPEED5V_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STEN16R32R */
#define IFX_PMS_EVRSDCTRL5_STEN16R32R_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STEN16R32R */
#define IFX_PMS_EVRSDCTRL5_STEN16R32R_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STEN16R32R */
#define IFX_PMS_EVRSDCTRL5_STEN16R32R_OFF (10u)

