valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STTH32ROFF */
#define IFX_PMS_EVRSDCTRL5_STTH32ROFF_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STTH32ROFF */
#define IFX_PMS_EVRSDCTRL5_STTH32ROFF_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STTH32ROFF */
#define IFX_PMS_EVRSDCTRL5_STTH32ROFF_OFF (11u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMEN */
#define IFX_PMS_EVRSDCTRL5_STCONLIMEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMEN */
#define IFX_PMS_EVRSDCTRL5_STCONLIMEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMEN */
#define IFX_PMS_EVRSDCTRL5_STCONLIMEN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMINC */
#define IFX_PMS_EVRSDCTRL5_STCONLIMINC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMINC */
#define IFX_PMS_EVRSDCTRL5_STCONLIMINC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STCONLIMINC */
#define IFX_PMS_EVRSDCTRL5_STCONLIMINC_OFF (17u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.STCONDEC */
#define IFX_PMS_EVRSDCTRL5_STCONDEC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.STCONDEC */
#define IFX_PMS_EVRSDCTRL5_STCONDEC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.STCONDEC */
#define IFX_PMS_EVRSDCTRL5_STCONDEC_OFF (19u)

/** \brief Length for Ifx_PMS_EVRSDCTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL5_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL5_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL5_Bits.LCK */
#define IFX_PMS_EVRSDCTRL5_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SYNCLCKOPT */
#define IFX_PMS_EVRSDCTRL6_SYNCLCKOPT_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SYNCLCKOPT */
#define IFX_PMS_EVRSDCTRL6_SYNCLCKOPT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SYNCLCKOPT */
#define IFX_PMS_EVRSDCTRL6_SYNCLCKOPT_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SYNCSPOINT */
#define IFX_PMS_EVRSDCTRL6_SYNCSPOINT_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SYNCSPOINT */
#define IFX_PMS_EVRSDCTRL6_SYNCSPOINT_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SYNCSPOINT */
#define IFX_PMS_EVRSDCTRL6_SYNCSPOINT_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL6_SYNCDIVFAC_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL6_SYNCDIVFAC_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.SYNCDIVFAC */
#define IFX_PMS_EVRSDCTRL6_SYNCDIVFAC_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL6_Bits.LCK */
#define IFX_PMS_EVRSDCTRL6_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL7_FBADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL7_FBADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCOFFS */
#define IFX_PMS_EVRSDCTRL7_FBADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL7_FBADCSMP_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL7_FBADCSMP_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCSMP */
#define IFX_PMS_EVRSDCTRL7_FBADCSMP_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL7_FBADCBLNK_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL7_FBADCBLNK_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCBLNK */
#define IFX_PMS_EVRSDCTRL7_FBADCBLNK_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL7_FBADCLPF_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL7_FBADCLPF_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLPF */
#define IFX_PMS_EVRSDCTRL7_FBADCLPF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCNS */
#define IFX_PMS_EVRSDCTRL7_FBADCNS_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCNS */
#define IFX_PMS_EVRSDCTRL7_FBADCNS_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCNS */
#define IFX_PMS_EVRSDCTRL7_FBADCNS_OFF (22u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL7_FBADCLSB_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL7_FBADCLSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.FBADCLSB */
#define IFX_PMS_EVRSDCTRL7_FBADCLSB_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL7_Bits.LCK */
#define IFX_PMS_EVRSDCTRL7_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FFADCOFFS_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FFADCOFFS_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FFADCOFFS */
#define IFX_PMS_EVRSDCTRL8_FFADCOFFS_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.VINDIG */
#define IFX_PMS_EVRSDCTRL8_VINDIG_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.VINDIG */
#define IFX_PMS_EVRSDCTRL8_VINDIG_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.VINDIG */
#define IFX_PMS_EVRSDCTRL8_VINDIG_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL8_FFADCLPF_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL8_FFADCLPF_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.FFADCLPF */
#define IFX_PMS_EVRSDCTRL8_FFADCLPF_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.VINSEL */
#define IFX_PMS_EVRSDCTRL8_VINSEL_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.VINSEL */
#define IFX_PMS_EVRSDCTRL8_VINSEL_MSK (0x1u)

