valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.VINSEL */
#define IFX_PMS_EVRSDCTRL8_VINSEL_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL8_Bits.LCK */
#define IFX_PMS_EVRSDCTRL8_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL9_SHVH_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL9_SHVH_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.SHVH */
#define IFX_PMS_EVRSDCTRL9_SHVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL9_SHVL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL9_SHVL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.SHVL */
#define IFX_PMS_EVRSDCTRL9_SHVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL9_SHHVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL9_SHHVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.SHHVEN */
#define IFX_PMS_EVRSDCTRL9_SHHVEN_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL9_SHLVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL9_SHLVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL9_SHLVEN_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL9_Bits.LCK */
#define IFX_PMS_EVRSDCTRL9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONEN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONEN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONEN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONEN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONMIN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONMIN_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONMIN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONMIN_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTLOCONMIN */
#define IFX_PMS_EVRSDCTRL10_DTLOCONMIN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERREN */
#define IFX_PMS_EVRSDCTRL10_DTOVERREN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERREN */
#define IFX_PMS_EVRSDCTRL10_DTOVERREN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERREN */
#define IFX_PMS_EVRSDCTRL10_DTOVERREN_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERRMIN */
#define IFX_PMS_EVRSDCTRL10_DTOVERRMIN_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERRMIN */
#define IFX_PMS_EVRSDCTRL10_DTOVERRMIN_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTOVERRMIN */
#define IFX_PMS_EVRSDCTRL10_DTOVERRMIN_OFF (9u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTOV3V3BASE */
#define IFX_PMS_EVRSDCTRL10_DTOV3V3BASE_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTOV3V3BASE */
#define IFX_PMS_EVRSDCTRL10_DTOV3V3BASE_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTOV3V3BASE */
#define IFX_PMS_EVRSDCTRL10_DTOV3V3BASE_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.DTOV5VBASE */
#define IFX_PMS_EVRSDCTRL10_DTOV5VBASE_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.DTOV5VBASE */
#define IFX_PMS_EVRSDCTRL10_DTOV5VBASE_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.DTOV5VBASE */
#define IFX_PMS_EVRSDCTRL10_DTOV5VBASE_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL10_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL10_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.LCK */
#define IFX_PMS_EVRSDCTRL10_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.SD33I */
#define IFX_PMS_EVRSDCOEFF0_SD33I_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.SD33I */
#define IFX_PMS_EVRSDCOEFF0_SD33I_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.SD33I */
#define IFX_PMS_EVRSDCOEFF0_SD33I_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.SD33P */
#define IFX_PMS_EVRSDCOEFF0_SD33P_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.SD33P */
#define IFX_PMS_EVRSDCOEFF0_SD33P_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.SD33P */
#define IFX_PMS_EVRSDCOEFF0_SD33P_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.SD5I */
#define IFX_PMS_EVRSDCOEFF0_SD5I_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.SD5I */
#define IFX_PMS_EVRSDCOEFF0_SD5I_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.SD5I */
#define IFX_PMS_EVRSDCOEFF0_SD5I_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.SD5P */
#define IFX_PMS_EVRSDCOEFF0_SD5P_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.SD5P */
#define IFX_PMS_EVRSDCOEFF0_SD5P_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.SD5P */
#define IFX_PMS_EVRSDCOEFF0_SD5P_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.PICHNGTHR */
#define IFX_PMS_EVRSDCOEFF1_PICHNGTHR_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.PICHNGTHR */
#define IFX_PMS_EVRSDCOEFF1_PICHNGTHR_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.PICHNGTHR */
#define IFX_PMS_EVRSDCOEFF1_PICHNGTHR_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV3V3 */
#define IFX_PMS_EVRSDCOEFF1_PILOV3V3_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV3V3 */
#define IFX_PMS_EVRSDCOEFF1_PILOV3V3_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV3V3 */
#define IFX_PMS_EVRSDCOEFF1_PILOV3V3_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV5V */
#define IFX_PMS_EVRSDCOEFF1_PILOV5V_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV5V */
#define IFX_PMS_EVRSDCOEFF1_PILOV5V_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.PILOV5V */
#define IFX_PMS_EVRSDCOEFF1_PILOV5V_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADEN */
#define IFX_PMS_EVRSDCOEFF1_PILOVADEN_LEN (1u)

