valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADEN */
#define IFX_PMS_EVRSDCOEFF1_PILOVADEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADEN */
#define IFX_PMS_EVRSDCOEFF1_PILOVADEN_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADPT */
#define IFX_PMS_EVRSDCOEFF1_PILOVADPT_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADPT */
#define IFX_PMS_EVRSDCOEFF1_PILOVADPT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.PILOVADPT */
#define IFX_PMS_EVRSDCOEFF1_PILOVADPT_OFF (25u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.CHNGHYST */
#define IFX_PMS_EVRSDCOEFF1_CHNGHYST_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.CHNGHYST */
#define IFX_PMS_EVRSDCOEFF1_CHNGHYST_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.CHNGHYST */
#define IFX_PMS_EVRSDCOEFF1_CHNGHYST_OFF (26u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF1 */
#define IFX_PMS_EVRSDCOEFF2_COEFF1_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF1 */
#define IFX_PMS_EVRSDCOEFF2_COEFF1_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF1 */
#define IFX_PMS_EVRSDCOEFF2_COEFF1_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF2 */
#define IFX_PMS_EVRSDCOEFF2_COEFF2_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF2 */
#define IFX_PMS_EVRSDCOEFF2_COEFF2_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF2 */
#define IFX_PMS_EVRSDCOEFF2_COEFF2_OFF (11u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF3V3 */
#define IFX_PMS_EVRSDCOEFF2_COEFF3V3_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF3V3 */
#define IFX_PMS_EVRSDCOEFF2_COEFF3V3_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF3V3 */
#define IFX_PMS_EVRSDCOEFF2_COEFF3V3_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF5V */
#define IFX_PMS_EVRSDCOEFF2_COEFF5V_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF5V */
#define IFX_PMS_EVRSDCOEFF2_COEFF5V_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.COEFF5V */
#define IFX_PMS_EVRSDCOEFF2_COEFF5V_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.LINEADAPEN */
#define IFX_PMS_EVRSDCOEFF2_LINEADAPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.LINEADAPEN */
#define IFX_PMS_EVRSDCOEFF2_LINEADAPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.LINEADAPEN */
#define IFX_PMS_EVRSDCOEFF2_LINEADAPEN_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.LINEPOSTHR */
#define IFX_PMS_EVRSDCOEFF2_LINEPOSTHR_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.LINEPOSTHR */
#define IFX_PMS_EVRSDCOEFF2_LINEPOSTHR_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.LINEPOSTHR */
#define IFX_PMS_EVRSDCOEFF2_LINEPOSTHR_OFF (25u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.LINENEGTHR */
#define IFX_PMS_EVRSDCOEFF2_LINENEGTHR_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.LINENEGTHR */
#define IFX_PMS_EVRSDCOEFF2_LINENEGTHR_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.LINENEGTHR */
#define IFX_PMS_EVRSDCOEFF2_LINENEGTHR_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF2_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF2_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF2_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.BYPONTHR */
#define IFX_PMS_EVRSDCOEFF3_BYPONTHR_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.BYPONTHR */
#define IFX_PMS_EVRSDCOEFF3_BYPONTHR_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.BYPONTHR */
#define IFX_PMS_EVRSDCOEFF3_BYPONTHR_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN0 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN0 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN0 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN0_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN1 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN1_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN1 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN1_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN1 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN1_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN2 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN2 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN2_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.SDDIGIN2 */
#define IFX_PMS_EVRSDCOEFF3_SDDIGIN2_OFF (21u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF3_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF3_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF3_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF3_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF3_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF3_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_OFF (4u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_OFF (5u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_OFF (6u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_LEN (1u)

