valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF14 */
#define IFX_PMS_AG_STDBY1_SF14_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF14 */
#define IFX_PMS_AG_STDBY1_SF14_OFF (14u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF15 */
#define IFX_PMS_AG_STDBY1_SF15_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF15 */
#define IFX_PMS_AG_STDBY1_SF15_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF15 */
#define IFX_PMS_AG_STDBY1_SF15_OFF (15u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF16 */
#define IFX_PMS_AG_STDBY1_SF16_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF16 */
#define IFX_PMS_AG_STDBY1_SF16_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF16 */
#define IFX_PMS_AG_STDBY1_SF16_OFF (16u)

/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.TSTOK */
#define IFX_PMS_MONBISTSTAT_TSTOK_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.TSTOK */
#define IFX_PMS_MONBISTSTAT_TSTOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.TSTOK */
#define IFX_PMS_MONBISTSTAT_TSTOK_OFF (0u)

/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.TSTRUN */
#define IFX_PMS_MONBISTSTAT_TSTRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.TSTRUN */
#define IFX_PMS_MONBISTSTAT_TSTRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.TSTRUN */
#define IFX_PMS_MONBISTSTAT_TSTRUN_OFF (2u)

/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.TSTDONE */
#define IFX_PMS_MONBISTSTAT_TSTDONE_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.TSTDONE */
#define IFX_PMS_MONBISTSTAT_TSTDONE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.TSTDONE */
#define IFX_PMS_MONBISTSTAT_TSTDONE_OFF (3u)

/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.SMUERR */
#define IFX_PMS_MONBISTSTAT_SMUERR_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.SMUERR */
#define IFX_PMS_MONBISTSTAT_SMUERR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.SMUERR */
#define IFX_PMS_MONBISTSTAT_SMUERR_OFF (4u)

/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_OFF (5u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_OFF (0u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_OFF (1u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_OFF (0u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_OFF (1u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_OFF (2u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_OFF (3u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_OFF (4u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_OFF (5u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_OFF (6u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_OFF (7u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_OFF (8u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_OFF (9u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_MSK (0x1u)

