valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY1_FE15_OFF (15u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE16 */
#define IFX_PMS_AGFSP_STDBY1_FE16_OFF (16u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY1_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSSTAT_Bits.RESULT */
#define IFX_PMS_DTSSTAT_RESULT_OFF (0u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.LOWER */
#define IFX_PMS_DTSLIM_LOWER_OFF (0u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.LLU */
#define IFX_PMS_DTSLIM_LLU_OFF (15u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_LEN (12u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_MSK (0xfffu)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.UPPER */
#define IFX_PMS_DTSLIM_UPPER_OFF (16u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.SLCK */
#define IFX_PMS_DTSLIM_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_LEN (1u)

/** \brief Mask for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_DTSLIM_Bits.UOF */
#define IFX_PMS_DTSLIM_UOF_OFF (31u)

/** \brief Length for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSS_Bits.OTGB0 */
#define IFX_PMS_OTSS_OTGB0_OFF (0u)

/** \brief Length for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSS_Bits.OTGB1 */
#define IFX_PMS_OTSS_OTGB1_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B0LAM */
#define IFX_PMS_OTSC0_B0LAM_OFF (0u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B0HAM */
#define IFX_PMS_OTSC0_B0HAM_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B1LAM */
#define IFX_PMS_OTSC0_B1LAM_OFF (16u)

/** \brief Length for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC0_Bits.B1HAM */
#define IFX_PMS_OTSC0_B1HAM_OFF (24u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.B0EC */
#define IFX_PMS_OTSC1_B0EC_OFF (0u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_LEN (4u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.B1EC */
#define IFX_PMS_OTSC1_B1EC_OFF (8u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_LEN (8u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.DMONAD */
#define IFX_PMS_OTSC1_DMONAD_OFF (16u)

/** \brief Length for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_LEN (8u)

/** \brief Mask for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OTSC1_Bits.SMCDBG */
#define IFX_PMS_OTSC1_SMCDBG_OFF (24u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN0 */
#define IFX_PMS_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN1 */
#define IFX_PMS_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN2 */
#define IFX_PMS_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_PMS_ACCEN0_Bits.EN3 */
#define IFX_PMS_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_PMS_ACCEN0_Bits.EN4 */
#define IFX_PMS_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_PMS_ACCEN0_Bits.EN4 */
#define IFX_PMS_ACCEN0_EN4_MSK (0x1u)

